Repository: SamXCode73/LiteClinic
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ar, fr_fr

# Rpg_NoteZeroCounts.Text
source: Note: Counts will remain 0 until appointments are marked as Attended or Missed for patients and doctors.
ar: ملاحظة: ستبقى الأعداد 0 حتى يتم تحديد المواعيد كـ "حضر" أو "غاب" للمرضى والأطباء.
fr_fr: Remarque : Les comptes resteront à 0 tant que les rendez-vous ne sont pas marqués comme Présents ou Absents pour les patients et les médecins.

# Rpg_TotalLabel.Text
source: Total
ar: المجموع

# Rpg_DoctorsLabel.Text
source: Doctors
ar: الأطباء
fr_fr: Médecins

# Rpg_TodayDoctors.Text
source: Today:
ar: اليوم:
fr_fr: Aujourd’hui :

# Rpg_WeekDoctors.Text
source: This Week:
ar: هذا الأسبوع:
fr_fr: Cette semaine :

# Rpg_MonthDoctors.Text
source: This Month:
ar: هذا الشهر:
fr_fr: Ce mois-ci :

# Rpg_YearDoctors.Text
source: This Year:
ar: هذه السنة:
fr_fr: Cette année :

# Rpg_TotalLabelPatients.Text
source: Total
ar: المجموع

# Rpg_PatientsLabel.Text
source: Patients
ar: المرضى

# Rpg_TodayPatients.Text
source: Today:
ar: اليوم:
fr_fr: Aujourd’hui :

# Rpg_WeekPatients.Text
source: This Week:
ar: هذا الأسبوع:
fr_fr: Cette semaine :

# Rpg_MonthPatients.Text
source: This Month:
ar: هذا الشهر:
fr_fr: Ce mois-ci :

# Rpg_YearPatients.Text
source: This Year:
ar: هذه السنة:
fr_fr: Cette année :

# Rpg_MissedLabel.Text
source: Missed
ar: المواعيد الفائتة
fr_fr: Absents

# Rpg_AppointmentsLabel.Text
source: Appointments
ar: المواعيد
fr_fr: Rendez-vous

# Rpg_TodayMissed.Text
source: Today:
ar: اليوم:
fr_fr: Aujourd’hui :

# Rpg_WeekMissed.Text
source: This Week:
ar: هذا الأسبوع:
fr_fr: Cette semaine :

# Rpg_MonthMissed.Text
source: This Month:
ar: هذا الشهر:
fr_fr: Ce mois-ci :

# Rpg_YearMissed.Text
source: This Year:
ar: هذه السنة:
fr_fr: Cette année :

# Rpg_AuditSummary.Text
source: Audit Summary
ar: ملخص التدقيق
fr_fr: Résumé d’audit

# Rpg_Administrator.Text
source: Administrator
ar: مدير النظام
fr_fr: Administrateur

# Rpg_HR.Text
source: HR
ar: الموارد البشرية
fr_fr: RH

# Rpg_Moderator.Text
source: Moderator
ar: المشرف
fr_fr: Modérateur

# Rpg_DoctorRole.Text
source: Doctor
ar: طبيب
fr_fr: Médecin

# Rpg_Pharmacist.Text
source: Pharmacist
ar: صيدلي
fr_fr: Pharmacien

# Rpg_Nurse.Text
source: Nurse
ar: ممرضة
fr_fr: Infirmier

# Rpg_Receptionist.Text
source: Receptionist
ar: موظف استقبال
fr_fr: Réceptionniste

# Rpg_Guest.Text
source: Guest
ar: ضيف
fr_fr: Invité

# Rpg_MostCommonRole.Text
source: Most Common Role
ar: أكثر دور شائع
fr_fr: Rôle le plus courant

# Rpg_PatientsLabelCard.Text
source: Patients
ar: المرضى

# Rpg_TopDoctorTitle.Text
source: Top Doctors of {0}
ar: أفضل الأطباء لسنة {0}
fr_fr: Meilleurs médecins de {0}

# Rpg_TopSpecializationsTitle.Text
source: Top Specializations of {0}
ar: أفضل التخصصات لسنة {0}
fr_fr: Meilleures spécialisations de {0}

# Rpg_DoctorsAxis.Header
source: Doctors
ar: الأطباء
fr_fr: Médecins

# Rpg_PatientsAxis.Header
source: Patients
ar: المرضى

# Rpg_SpecializationsAxis.Header
source: Specializations
ar: التخصصات
fr_fr: Spécialisations

# Rpg_PatientsAxisSpecializations.Header
source: Patients
ar: المرضى

# SchDp_TimeStampCannotBeNull
source: Time stamp cannot be null. Value: {0}
ar: لا يمكن أن يكون التوقيت فارغًا. القيمة: {0}
fr_fr: L’horodatage ne peut pas être vide. Valeur : {0}

# SchDp_TimeStampIsSameOrInvalid
source: The time stamp is the same or invalid. Value: From: {0} To: {1}
ar: التوقيت متماثل أو غير صالح. من: {0} إلى: {1}
fr_fr: L’horodatage est identique ou invalide. De : {0} À : {1}

# SchDp_TimePickerFrom.Header
source: From:
ar: من:
fr_fr: De :

# SchDp_TimePickerTo.Header
source: To:
ar: إلى:
fr_fr: À :

# SchDp_AddDoctorScheduled.Text
source: Add Doctor's Scheduled
ar: إضافة جدول الطبيب
fr_fr: Ajouter la planification du médecin

# SchDp_ChooseDoctor.Header
source: Choose doctor
ar: اختر الطبيب
fr_fr: Choisir un médecin

# SchDp_DayOfWeek.Header
source: Day of Week
ar: يوم الأسبوع
fr_fr: Jour de la semaine

# SchDp_Monday.Content
source: Monday
ar: الاثنين
fr_fr: Lundi

# SchDp_Tuesday.Content
source: Tuesday
ar: الثلاثاء
fr_fr: Mardi

# SchDp_Wednesday.Content
source: Wednesday
ar: الأربعاء
fr_fr: Mercredi

# SchDp_Thursday.Content
source: Thursday
ar: الخميس
fr_fr: Jeudi

# SchDp_Friday.Content
source: Friday
ar: الجمعة
fr_fr: Vendredi

# SchDp_Saturday.Content
source: Saturday
ar: السبت
fr_fr: Samedi

# SchDp_Week1.Content
source: Week 1
ar: الأسبوع 1
fr_fr: Semaine 1

# SchDp_Week2.Content
source: Week 2
ar: الأسبوع 2
fr_fr: Semaine 2

# SchDp_Week3.Content
source: Week 3
ar: الأسبوع 3
fr_fr: Semaine 3

# SchDp_Week4.Content
source: Week 4
ar: الأسبوع 4
fr_fr: Semaine 4

# SchDp_Week5.Content
source: Week 5 (if available)
ar: الأسبوع 5 (إن وجد)
fr_fr: Semaine 5 (si disponible)

# SchDp_Week5Note.Text
source: Week 5 notifications are only sent if selected and the month contains a fifth weekday.To avoid conflicts where notifications may not be sent in week 5, please always check week 5 if available.
ar: يتم إرسال إشعارات الأسبوع الخامس فقط إذا تم تحديده وكان الشهر يحتوي على خامس يوم من أيام الأسبوع. ولتفادي أي تعارض قد يؤدي إلى عدم إرسال الإشعارات في الأسبوع الخامس، يُرجى دائمًا تحديد الأسبوع الخامس إذا كان متاحًا.
fr_fr: Les notifications de la semaine 5 ne sont envoyées que si elles sont sélectionnées et que le mois contient un cinquième jour de semaine. Pour éviter tout conflit où les notifications pourraient ne pas être envoyées en semaine 5, veuillez toujours cocher la semaine 5 si elle est disponible.

# SchDp_NotifyClinic.Content
source: Notify for Clinic
ar: إشعار للعيادة
fr_fr: Notifier la clinique

# SchDp_IsActive.Content
source: Is Active
ar: نشط
fr_fr: Actif

# SchDp_AddButton.Content
source: Add
ar: إضافة
fr_fr: Ajouter

# SchDp_EditButton.Content
source: Edit
ar: تعديل
fr_fr: Modifier

# SchDp_DeactivateButton.Content
source: Deactivate
ar: إلغاء التفعيل
fr_fr: Désactiver

# SchDp_ClearButton.Content
source: Clear
ar: مسح
fr_fr: Effacer

# SchDp_BackButton.Content
source: Back to Doctor's Page
ar: العودة إلى صفحة الطبيب
fr_fr: Retour à la page du médecin

# SchDp_AutoColumn.Header
source: Auto
ar: تلقائي

# SchDp_ScheduledIdColumn.Header
source: Schdled Id
ar: معرّف الجدولة
fr_fr: ID planifié

# SchDp_DoctorIdColumn.Header
source: Doctor's ID
ar: معرّف الطبيب
fr_fr: ID du médecin

# SchDp_DoctorNameColumn.Header
source: Doctor's Name
ar: اسم الطبيب
fr_fr: Nom du médecin

# SchDp_SpecializationColumn.Header
source: Specialization
ar: الاختصاص
fr_fr: Spécialisation

# SchDp_PhoneColumn.Header
source: Mobile Phone
ar: ا
fr_fr: Téléphone portable

# SchDp_DayOfWeekColumn.Header
source: Day Of the Week
ar: يوم الأسبوع
fr_fr: Jour de la semaine

# SchDp_NotifyColumn.Header
source: Notify
ar: إشعار
fr_fr: Notifier

# SchDp_ActiveColumn.Header
source: Active
ar: نشط
fr_fr: Actif

# SchDp_WeeksColumn.Header
source: Weeks of Month
ar: أسابيع الشهر
fr_fr: Semaines du mois

# SchDp_AddLegend.Text
source: Add = F1
ar: إضافة = F1
fr_fr: Ajouter = F1

# SchDp_EditLegend.Text
source: Edit = F2
ar: تعديل = F2
fr_fr: Modifier = F2

# SchDp_DeactivateLegend.Text
source: Deactivate = F3
ar: إلغاء التفعيل = F3
fr_fr: Désactiver = F3

# SchDp_ClearLegend.Text
source: Clear = F4
ar: مسح = F4
fr_fr: Effacer = F4

# SchDp_DeactivatedUserLegend.Text
source: Deactivated User
ar: مستخدم غير مفعل
fr_fr: Utilisateur désactivé

# SchDp_RequiredFieldsNote.Text
source: Required fields are marked with a red circle
ar: الحقول المطلوبة مميزة بدائرة حمراء
fr_fr: Les champs obligatoires sont marqués d’un cercle rouge

# SchDp_StatusMessageSch
source: Error loading Scheduled: {0}
ar: خطأ في تحميل الجدول: {0}
fr_fr: Erreur lors du chargement de la planification : {0}

# SchDp_StatusMessageSchLoaded
source: Loaded {0} Scheduled.
ar: تم تحميل {0} جدول.
fr_fr: {0} planifications chargées.

# SchDp_StatusMessageSchLoadedDisplay
source: Loaded {0} Scheduled.
ar: تم تحميل {0} جدول.
fr_fr: {0} planifications chargées.

# SchDp_StatusMessageSchDoctorsError
source: Error loading Doctors: {0}
ar: خطأ في تحميل الأطباء: {0}
fr_fr: Erreur lors du chargement des médecins : {0}

# SchDp_StatusMessageSchDoctorDayRequired
source: Doctor and day of week are required.
ar: يجب اختيار الطبيب ويوم الأسبوع.
fr_fr: Le médecin et le jour de la semaine sont requis.

# SchDp_StatusMessageSchScheduleAdded
source: Schedule has been added successfully.
ar: تمت إضافة الجدول بنجاح.
fr_fr: La planification a été ajoutée avec succès.

# SchDp_StatusMessageSchScheduleAddedError
source: Failed to add schedule.
ar: فشل في إضافة الجدول.
fr_fr: Échec de l’ajout de la planification.

# SchDp_StatusMessageSchNoScheduleForUpdate
source: No schedule selected for update.
ar: لم يتم اختيار جدول للتحديث.
fr_fr: Aucune planification sélectionnée pour la mise à jour.

# SchDp_StatusMessageSchWeekRequired
source: Please select at least one week (Week 1–4).
ar: يرجى اختيار أسبوع واحد على الأقل (الأسبوع 1–4).
fr_fr: Veuillez sélectionner au moins une semaine (Semaine 1–4).

# SchDp_StatusMessageSchOverlap
source: This doctor is already scheduled for that day in overlapping week(s). Scheduled ID {0}
ar: هذا الطبيب مجدول بالفعل في ذلك اليوم ضمن أسابيع متداخلة. معرّف الجدول {0}
fr_fr: Ce médecin est déjà planifié pour ce jour dans des semaines qui se chevauchent. ID planifié {0}

# SchDp_StatusMessageSchScheduleUpdated
source: Schedule has been updated successfully.
ar: تم تحديث الجدول بنجاح.
fr_fr: La planification a été mise à jour avec succès.

# SchDp_StatusMessageSchScheduleUpdatedError
source: Failed to update schedule.
ar: فشل في تحديث الجدول.
fr_fr: Échec de la mise à jour de la planification.

# SchDp_StatusMessageSchNoScheduleForDeactivation
source: No schedule selected for deactivation.
ar: لم يتم اختيار جدول للتعطيل.
fr_fr: Aucune planification sélectionnée pour la désactivation.

# SchDp_StatusMessageSchScheduleDeactivated
source: Schedule has been deactivated successfully.
ar: تم تعطيل الجدول بنجاح.
fr_fr: La planification a été désactivée avec succès.

# SchDp_StatusMessageSchScheduleDeactivatedError
source: Failed to deactivate schedule.
ar: فشل في تعطيل الجدول.
fr_fr: Échec de la désactivation de la planification.

# SchDp_ScheduleDoctorNameBox.Header
source: Choose doctor
ar: اختر الطبيب
fr_fr: Choisir un médecin

# SchDp_ScheduleDayOfWeekBox.Header
source: Day of Week
ar: يوم الأسبوع
fr_fr: Jour de la semaine

# SchDp_DoctorsManagerListTextBlock.Text
source: Doctors Manager List
ar: قائمة إدارة الأطباء
fr_fr: Liste des médecins gestionnaires

# SchDp_ScheduleSearchBox.PlaceholderText
source: Search
ar: بحث
fr_fr: Rechercher

# SIDp_SelectMessagingPlatformPatients.Text
source: Select Messaging Platform - Patients
ar: اختر منصة المراسلة - المرضى
fr_fr: Sélectionner la plateforme de messagerie - Patients

# SIDp_AddServiceTitle.Text
source: Add Service
ar: إضافة خدمة
fr_fr: Ajouter un service

# SIDp_PatientIdLabel.Text
source: Patient ID:
ar: رقم المريض:
fr_fr: ID patient :

# SIDp_PatientIdTextBox.PlaceholderText
source: Enter Patient ID
ar: أدخل رقم المريض
fr_fr: Entrez l’ID du patient

# SIDp_PatientCodeLabel.Text
source: Patient Code/Text:
ar: رمز المريض:
fr_fr: Code/Text patient :

# SIDp_PatientCodeTextBox.PlaceholderText
source: Enter Patient Code
ar: أدخل رمز المريض
fr_fr: Entrez le code du patient

# SIDp_ServiceNameLabel.Text
source: Service Name:
ar: اسم الخدمة:
fr_fr: Nom du service :

# SIDp_ServiceNameTelegram.Content
source: Telegram
ar: تيليجرام

# SIDp_ServiceNameWhatsApp.Content
source: WhatsApp
ar: واتساب

# SIDp_ServiceNameDiscord.Content
source: Discord
ar: ديسكورد

# SIDp_ServiceNameEmail.Content
source: Email
ar: البريد الإلكتروني

# SIDp_ServiceNameSms.Content
source: Sms
ar: رسائل قصيرة

# SIDp_ServiceNameSlack.Content
source: Slack
ar: سلاك

# SIDp_ServiceNameViber.Content
source: Viber
ar: فايبر

# SIDp_ServiceNameTeams.Content
source: MicrosoftTeams
ar: مايكروسوفت تيمز

# SIDp_ServiceNameMessenger.Content
source: FacebookMessenger
ar: ماسنجر فيسبوك

# SIDp_ServiceIdLabel.Text
source: Service ID:
ar: معرّف الخدمة:
fr_fr: ID du service :

# SIDp_ServiceIdTextBox.PlaceholderText
source: Enter Chat ID / Number
ar: أدخل معرف الدردشة / الرقم
fr_fr: Entrez l’ID du chat / numéro

# SIDp_IsActiveLabel.Text
source: Is Active:
ar: نشط:
fr_fr: Actif :

# SIDp_SendNotificationLabel.Text
source: Send Notification with
ar: إرسال إشعار باستخدام
fr_fr: Envoyer la notification avec

# SIDp_NotifyEnglishLabel.Text
source: English
ar: الإنجليزية
fr_fr: Anglais

# SIDp_NotifyArabicLabel.Text
source: Arabic
ar: العربية
fr_fr: Arabe

# SIDp_ApplyPatientServiceButton.Content
source: Apply Patient Service
ar: تطبيق خدمة المريض
fr_fr: Appliquer le service patient

# SIDp_ClearButton.Content
source: Clear
ar: مسح
fr_fr: Effacer

# SIDp_SearchBox.PlaceholderText
source: Search Service/Patient Id
ar: بحث عن الخدمة/معرف المريض
fr_fr: Rechercher service / ID patient

# SIDp_HeaderServiceIdAuto.Header
source: Service ID Auto
ar: معرّف الخدمة التلقائي
fr_fr: ID service auto

# SIDp_HeaderPatientId.Header
source: Patient ID
ar: رقم المريض
fr_fr: ID patient

# SIDp_HeaderCode.Header
source: Code
ar: الرمز

# SIDp_HeaderServiceName.Header
source: Service Name
ar: اسم الخدمة
fr_fr: Nom du service

# SIDp_HeaderServiceId.Header
source: Service ID
ar: معرّف الخدمة
fr_fr: ID du service

# SIDp_HeaderActive.Header
source: Active
ar: نشط
fr_fr: Actif

# SIDp_HeaderNotifyEn.Header
source: Notify En
ar: إشعار بالإنجليزية
fr_fr: Notifier (EN)

# SIDp_HeaderNotifyAr.Header
source: Notify Ar
ar: إشعار بالعربية
fr_fr: Notifier (AR)

# SIDp_HeaderNotifyFr.Header
source: Notify Fr
ar: إشعار بالفرنسية
fr_fr: Notifier (FR)

# SIDp_ApplyPatientServiceButton.ToolTipService.ToolTip
source: Save/Update - F1
ar: حفظ/تحديث - F1
fr_fr: Enregistrer/Mettre à jour - F1

# SIDp_ClearButton.ToolTipService.ToolTip
source: Clear Fields - F4
ar: مسح الحقول - F4
fr_fr: Effacer les champs - F4

# SIDp_StatusMessagePatientIdServiceRequired
source: Patient ID and Service identifier are required.
ar: رقم المريض ومعرّف الخدمة مطلوبان.
fr_fr: L’ID patient et l’identifiant du service sont requis.

# SIDp_StatusMessageNewPatientServiceAdded
source: New patient service added.
ar: تمت إضافة خدمة مريض جديدة.
fr_fr: Nouveau service patient ajouté.

# SIDp_StatusMessageServiceAlreadyExists
source: This service {0} already exists for patient ID: {1} - {2}
ar: هذه الخدمة {0} موجودة بالفعل لرقم المريض: {1} - {2}
fr_fr: Ce service {0} existe déjà pour l’ID patient : {1} - {2}

# SIDp_StatusMessagePatientServiceUpdated
source: Patient service updated.
ar: تم تحديث خدمة المريض.
fr_fr: Service patient mis à jour.

# SIDp_StatusMessageErrorSavingPatientService
source: Error saving patient service.
ar: خطأ في حفظ خدمة المريض.
fr_fr: Erreur lors de l’enregistrement du service patient.

# SIDp_StatusMessageClearingAndRefreshing
source: Clearing and refreshing. Please wait...
ar: جارٍ المسح والتحديث. يرجى الانتظار...
fr_fr: Effacement et actualisation. Veuillez patienter...

# SIDp_StatusMessageWarningWrongIdOrDeactivated
source: WARNING!! Wrong ID or Patient {0} is deactivated.
ar: تحذير!! رقم خاطئ أو أن المريض {0} غير مفعل.
fr_fr: ⚠️ ATTENTION !! Mauvais ID ou patient {0} désactivé.

# SIDp_NotifyFrenchLabel.Text
source: French
ar: الفرنسية
fr_fr: Français

# SIDp_StatusMessageWarningPatientIdNotFound
source: WARNING! Patient ID not found.
ar: تحذير! لم يتم العثور على رقم المريض.
fr_fr: ⚠️ ATTENTION ! ID patient introuvable.

# Stp_ThemeSelectionTitle.Text
source: Theme Selection
ar: اختيار السمة
fr_fr: Sélection du thème

# Stp_ThemeSelectionItemText.Text
source: Theme
ar: سمة
fr_fr: Thème

# Stp_ShowGregorianDateCheckBox.Content
source: Show Gregorian Date
ar: عرض التاريخ الميلادي
fr_fr: Afficher la date grégorienne

# Stp_ShowHijriDateCheckBox.Content
source: Show Hijri Date
ar: عرض التاريخ الهجري
fr_fr: Afficher la date hégirienne

# Stp_LanguageSelectionComboBox.Text
source: Language
ar: اللغة
fr_fr: Langue

# Stp_LanguageSelectionItemText.Text
source: Language Option
ar: خيار اللغة
fr_fr: Option de langue

# Stp_WorkingDaysTitle.Text
source: Working Days
ar: أيام العمل
fr_fr: Jours ouvrables

# Stp_WorkingDaysMonday.Content
source: Mon
ar: الإثنين
fr_fr: Lun

# Stp_WorkingDaysTuesday.Content
source: Tue
ar: الثلاثاء
fr_fr: Mar

# Stp_WorkingDaysWednesday.Content
source: Wed
ar: الأربعاء
fr_fr: Mer

# Stp_WorkingDaysThursday.Content
source: Thu
ar: الخميس
fr_fr: Jeu

# Stp_WorkingDaysFriday.Content
source: Fri
ar: الجمعة
fr_fr: Ven

# Stp_WorkingDaysSaturday.Content
source: Sat
ar: السبت
fr_fr: Sam

# Stp_WorkingDaysSunday.Content
source: Sun
ar: الأحد
fr_fr: Dim

# Stp_WorkingDaysApplyButton.Content
source: Apply
ar: تطبيق
fr_fr: Appliquer

# Stp_NotificationsTitle.Text
source: Notifications
ar: الإشعارات

# Stp_NotifyPatient24hCheckBox.Content
source: Send patient notification 24h before appointment
ar: إرسال إشعار للمريض قبل 24 ساعة من الموعد
fr_fr: Envoyer une notification au patient 24h avant le rendez-vous

# Stp_NotifyPatient2hCheckBox.Content
source: Send patient notification 2h before appointment
ar: إرسال إشعار للمريض قبل ساعتين من الموعد
fr_fr: Envoyer une notification au patient 2h avant le rendez-vous

# Stp_NotifyDoctorCheckBox.Content
source: Enable doctor notifications
ar: تفعيل إشعارات الطبيب
fr_fr: Activer les notifications pour le médecin

# Stp_SendViaTelegramCheckBox.Content
source: Send via Telegram
ar: إرسال عبر تيليجرام
fr_fr: Envoyer via Telegram

# Stp_NavigateConfigPageButton.Content
source: Go to Configuration Page Helper
ar: الانتقال إلى صفحة المساعدة في الإعدادات
fr_fr: Aller à l’assistant de configuration

# Stp_BackupTitle.Text
source: Backup
ar: نسخ احتياطي
fr_fr: Sauvegarde

# Stp_BackupLocationTextBox.PlaceholderText
source: Select backup folder
ar: اختر مجلد النسخ الاحتياطي
fr_fr: Sélectionner le dossier de sauvegarde

# Stp_BrowseBackupButton.Content
source: Browse...
ar: تصفح...
fr_fr: Parcourir...

# Stp_BackupDatabaseButton.Content
source: Backup Database
ar: نسخ قاعدة البيانات احتياطياً
fr_fr: Sauvegarder la base de données

# Stp_ClinicNameTitle.Text
source: Clinic Name
ar: اسم العيادة
fr_fr: Nom de la clinique

# Stp_ClinicNameTextBox.PlaceholderText
source: Enter Clinic Name
ar: أدخل اسم العيادة
fr_fr: Entrez le nom de la clinique

# Stp_ClinicNameApplyButton.Content
source: Apply
ar: تطبيق
fr_fr: Appliquer

# Stp_LogsTitle.Text
source: Logs
ar: السجلات
fr_fr: Journaux

# Stp_LogsDescription.Text
source: View diagnostic and error logs
ar: عرض سجلات التشخيص والأخطاء
fr_fr: Voir les journaux de diagnostic et d’erreurs

# Stp_OpenLogFolderButton.Content
source: Open Log Folder
ar: فتح مجلد السجلات
fr_fr: Ouvrir le dossier des journaux

# Stp_StatusMessageThemeChangeSaved
source: Theme change saved. It will apply after you log out and back in, or the next time you open the app.
ar: تم حفظ تغيير السمة. سيتم تطبيقه بعد تسجيل الخروج والدخول مرة أخرى، أو في المرة التالية التي تفتح فيها التطبيق.
fr_fr: Changement de thème enregistré. Il sera appliqué après déconnexion et reconnexion, ou lors de la prochaine ouverture de l’application.

# Stp_StatusMessageThemeSaveFailed
source: Failed to save theme due to database error.
ar: فشل حفظ السمة بسبب خطأ في قاعدة البيانات.
fr_fr: Échec de l’enregistrement du thème en raison d’une erreur de base de données.

# Stp_StatusMessageApplyingChanges
source: Please wait, applying changes...
ar: يرجى الانتظار، جاري تطبيق التغييرات...
fr_fr: Veuillez patienter, application des modifications...

# Stp_StatusMessageChangesAppliedSuccessfully
source: Changes applied successfully.
ar: تم تطبيق التغييرات بنجاح.
fr_fr: Modifications appliquées avec succès.

# Stp_StatusMessageErrorLogCheck
source: Error. Please check the error.log file and search for {0}.
ar: خطأ. يرجى التحقق من ملف error.log والبحث عن {0}.
fr_fr: Erreur. Veuillez vérifier le fichier error.log et rechercher {0}.

# Stp_StatusMessageDatabaseFileNotFound
source: Database file not found.
ar: ملف قاعدة البيانات غير موجود.
fr_fr: Fichier de base de données introuvable.

# Stp_StatusMessageBackupFolderInvalid
source: Backup folder not set or invalid.
ar: مجلد النسخ الاحتياطي غير محدد أو غير صالح.
fr_fr: Dossier de sauvegarde non défini ou invalide.

# Stp_StatusMessageBackupGenerating
source: Generating backup, please wait...
ar: جاري إنشاء النسخة الاحتياطية، يرجى الانتظار...
fr_fr: Génération de la sauvegarde, veuillez patienter...

# Stp_StatusMessageBackupCreatedZipped
source: Backup created and zipped: {0}
ar: تم إنشاء النسخة الاحتياطية وضغطها: {0}
fr_fr: Sauvegarde créée et compressée : {0}

# Stp_StatusMessageBackupFailed
source: Backup failed! Check Error Log
ar: فشل النسخ الاحتياطي! تحقق من سجل الأخطاء
fr_fr: Échec de la sauvegarde ! Vérifiez le journal des erreurs

# Stp_StatusMessageClinicNameAdminOnly
source: Only Admin can change clinic name!
ar: فقط المسؤول يمكنه تغيير اسم العيادة!
fr_fr: Seul l’administrateur peut changer le nom de la clinique !

# Stp_StatusMessageClinicNameEmpty
source: Clinic name cannot be empty.
ar: لا يمكن أن يكون اسم العيادة فارغاً.
fr_fr: Le nom de la clinique ne peut pas être vide.

# Stp_StatusMessageClinicNameUpdated
source: Clinic Name has been Updated
ar: تم تحديث اسم العيادة
fr_fr: Le nom de la clinique a été mis à jour

# Stp_StatusMessageErrorLogCheckGeneral
source: An error occurred, check the error log!
ar: حدث خطأ، تحقق من سجل الأخطاء!
fr_fr: Une erreur est survenue, vérifiez le journal des erreurs !

# Stp_StatusMessageDateSettingsUpdated
source: Date display settings have been updated.
ar: تم تحديث إعدادات عرض التاريخ.
fr_fr: Les paramètres d’affichage de la date ont été mis à jour.

# Stp_StatusMessageErrorOccurredCheckLog
source: An error occurred, check the error log!
ar: حدث خطأ، تحقق من سجل الأخطاء!
fr_fr: Une erreur est survenue, vérifiez le journal des erreurs !

# Stp_StatusMessageLanguageUpdated
source: Language setting has been updated. Changes will apply after you close and reopen the app.
ar: تم تحديث إعداد اللغة. ستُطبق التغييرات بعد إغلاق التطبيق وإعادة فتحه.
fr_fr: Le paramètre de langue a été mis à jour. Les changements s’appliqueront après avoir fermé et rouvert l’application.

# Stp_CalendarSelectionTitle
source: Calendar
ar: التقويم
fr_fr: Calendrier

# Stp_StatusMessageLogFolderOpenFailed
source: Failed to open log folder
ar: فشل في فتح مجلد السجلات
fr_fr: Échec de l'ouverture du dossier des journaux

# SPNV_Theme.Content
source: Theme
ar: السمات
fr_fr: Thème

# SPNV_Theme.ToolTipService.ToolTip
source: Change application theme
ar: تغيير سمات التطبيق
fr_fr: Changer le thème de l'application

# SPNV_Language.Content
source: Language
ar: اللغة
fr_fr: Langue

# SPNV_Language.ToolTipService.ToolTip
source: Change application language
ar: تغيير لغة التطبيق
fr_fr: Changer la langue de l'application

# SPNV_Calendar.Content
source: Calendar
ar: التقويم
fr_fr: Calendrier

# SPNV_Calendar.ToolTipService.ToolTip
source: Manage calendar settings
ar: إدارة إعدادات التقويم
fr_fr: Gérer les paramètres du calendrier

# SPNV_WorkingDays.Content
source: Working Days
ar: أيام العمل
fr_fr: Jours ouvrables

# SPNV_WorkingDays.ToolTipService.ToolTip
source: Configure clinic working days
ar: تكوين أيام عمل العيادة
fr_fr: Configurer les jours ouvrables de la clinique

# SPNV_Notifications.Content
source: Notifications
ar: الإشعارات

# SPNV_Notifications.ToolTipService.ToolTip
source: Manage notification preferences
ar: إدارة تفضيلات الإشعارات
fr_fr: Gérer les préférences de notification

# SPNV_ClinicName.Content
source: Clinic Name
ar: اسم العيادة
fr_fr: Nom de la clinique

# SPNV_ClinicName.ToolTipService.ToolTip
source: Edit clinic name and details
ar: تعديل اسم العيادة والتفاصيل
fr_fr: Modifier le nom et les détails de la clinique

# SPNV_Backup.Content
source: Backup
ar: نسخ احتياطي
fr_fr: Sauvegarde

# SPNV_Backup.ToolTipService.ToolTip
source: Backup clinic data
ar: نسخ بيانات العيادة احتياطياً
fr_fr: Sauvegarder les données de la clinique

# SPNV_Logs.Content
source: Logs
ar: السجلات
fr_fr: Journaux
